$config{'about'} = 'Mailform Pro 4.1.4';

## 確認画面のタイプ
## 0: オーバーレイ / 1:フラット / 2: システムダイアログ / 3:確認なし
$config{'ConfirmationMode'} = 1;

## sendmailのパス
#$config{'sendmail'} = 'C:\sendmail\sendmail.exe';
$config{'sendmail'} = '/usr/sbin/sendmail';

## フォームの送信先
@mailto = ('info@timetable.jp');

## 自動返信メールの差出人名
$config{'fromname'} = '●印刷+デザイン=タイムテーブル●';

## 自動返信メールの差出人メールアドレス
$config{'mailfrom'} = $mailto[0];

## 念のためBCC送信宛先 (解除する場合は下記1行をコメントアウト)
#$config{'bcc'} = $mailto[0];

## メールの差出人を固定 (0:無効 / 1:固定)
$config{'fixed'} = 0;

## 通し番号の書式
$config{'SerialFormat'} = '<date>%04d';

## 通し番号への加算値
$config{'SerialBoost'} = 0;

## サンクスページのURL(URLかsend.cgiから見た相対パス)
$config{'ThanksPage'} = '../thanks_order_testprint.html?no=%s';

## 設置者に届くメールの件名
$config{'subject'} = '【ドット箔プリント】試し刷り ご注文確認メール';

## 設置者に届くメールの本文整形
$_TEXT{'posted'} = <<'__posted_body__';
<_会社名（店舗名）_>
<_お名前_> 様

この度は「印刷+デザイン=タイムテーブル ドット箔プリント」へご注文いただきまして、誠にありがとうございます。
下記のご案内にしたがって続けてご入稿へお進みください。
ご入稿いただきましたらデータチェック後、折り返しご連絡させていただきます。
どうぞよろしくお願いいたします。

----------------------------------------
1.入力内容のご確認
----------------------------------------
■ご注文内容
ご注文種別：試し刷りのご注文
商　品：<_商品_>
<%サイズ:サイズ%>
<%印刷用紙:印刷用紙%>
<%箔の色数:箔の色数%>
<%箔の色:箔の色%>
<%印刷色数:印刷色数%>
<%印刷枚数:印刷枚数%>
<%印刷納期:印刷納期%>
<%加工オプション:加工オプション%>
<%スジ入れ加工:スジ入れ加工%>
<%折り加工:折り加工%>
<%孔開け加工（加工）:孔開け加工（加工）%>
<%孔開け加工（サイズ）:孔開け加工（サイズ）%>
<%角丸加工（加工）:角丸加工（加工）%>
<%角丸加工（サイズ）:角丸加工（サイズ）%>
<%簡易マチ加工（加工）:簡易マチ加工（加工）%>
<%簡易マチ加工（厚さ）:簡易マチ加工（厚さ）%>
<%PP加工・PET加工:PP加工・PET加工%>
<%プロッターカット加工:プロッターカット加工%>

<%【2】サイズ:サイズ_2%>
<%【2】印刷用紙:印刷用紙_2%>
<%【2】箔の色数:箔の色数_2%>
<%【2】箔の色:箔の色_2%>
<%【2】印刷色数:印刷色数_2%>
<%【2】印刷枚数:印刷枚数_2%>
<%【2】印刷納期:印刷納期_2%>
<%【2】加工オプション:加工オプション_2%>
<%【2】スジ入れ加工:スジ入れ加工_2%>
<%【2】折り加工:折り加工_2%>
<%【2】孔開け加工（加工）:孔開け加工（加工）_2%>
<%【2】孔開け加工（サイズ）:孔開け加工（サイズ）_2%>
<%【2】角丸加工（加工）:角丸加工（加工）_2%>
<%【2】角丸加工（サイズ）:角丸加工（サイズ）_2%>
<%【2】簡易マチ加工（加工）:簡易マチ加工（加工）_2%>
<%【2】簡易マチ加工（厚さ）:簡易マチ加工（厚さ）_2%>
<%【2】PP加工・PET加工:PP加工・PET加工_2%>
<%【2】プロッターカット加工:プロッターカット加工_2%>

<%件数:件数%>

制作環境：OS：<_OS_>
　　　　　使用アプリ：<_使用アプリ_>
備　考：<_印刷に関する備考_>

■ご注文者さまの情報
<%会社名（店舗名）:会社名（店舗名）%>
お名前：<_お名前_>
メールアドレス：<_email_>
ご住所：〒<_郵便番号_>
　　　　<_都道府県_><_市区町村_> <_建物名_>
電話番号：<_電話番号_>
お支払：お支払方法：<_お支払方法_>
　　　　お支払のタイミング：<_お支払のタイミング_>
　　　　ポイントの使用有無：<_ポイントの使用有無_>
<%　　　　ご利用ポイント:　　　　ご利用ポイント%>
　　　　原宿紙店のクーポン使用：<_原宿紙店のクーポン使用_>
備　考：<_注文者情報に関する備考_>

■発送に関する情報
印刷納期・発送方法：<_印刷納期・発送方法_>

送り状の記載内容：<_送り状の記載内容_>

<%会社名（店舗名） :会社名（店舗名） %>
<%お名前 :お名前 %>
<%ご住所 :ご住所2 %>
<_都道府県2_><_市区町村2_><_建物名2_>
<%電話番号 :電話番号 %>
<%備　考 :発送に関する備考%>
----------------------------------------
2.データのご入稿について
----------------------------------------
データを1つのzipファイルにまとめてご入稿ください。

●10MBまでの場合
このメールにご返信・添付の上、ご入稿いただけます。

●10MBを超える場合
ファイル送信サービスをご利用ください。
このメールにご返信の上、ファイル送信サービスのダウンロードURLをお送りください。
(※ファイル送信サービスは他社様のサービスになります。お客さまご自身の責任のもとご利用ください。)

【Adobe Illustrator】のデータは当社aiテンプレートをご利用ください。
　白印刷のデータ作成方法は少々特殊です。
　また、試し刷りでは印刷可能範囲に制限があります。
　各印刷料金表ページの「印刷のみ 注文する」ボタンのすぐ下よりaiテンプレートをダウンロードいただき、
　アートボード左側のご説明を参考にしてご作成ください。

----------------------------------------
3.お支払について
----------------------------------------
●前払い（銀行振込）の場合
データチェック完了後に前払い割引(5%引)適用のご請求書をPDFファイルにて発行させていただきます。
先にデータをご入稿いただき、お振込の準備をしてお待ちください。

●前払い（クレジットカード払い）の場合
データチェック完了後に前払い割引(5%引)適用のご請求書をPDFファイルにて、
クレジットカード決済用URLをメールにて発行させていただきます。
先にデータをご入稿いただき、決済の準備をしてお待ちください。

●翌月末日払い（銀行振込）の場合（官公庁さま・資本金1,000万円以上の法人さまのみ選択可）
官公庁さま・資本金1,000万円以上の法人さまであることを確認させていただいた上で、
データチェック後に合計料金をご案内いたします。
ご請求書についてはPDFファイルにて「印刷開始メール」に添付させていただきます。
先にデータをご入稿いただき、お待ちください。


※本メールにお心当たりのない方は、恐れ入りますがその旨をご記入の上、
メール本文をそのままご返信くださいませ。

●○--------------------------------------->
●○印刷+デザイン=タイムテーブル
●○　　　　ドット箔プリント
●○https://foil.timetable.jp/
●○--------------------------------------->
●○運営会社　株式会社タイムテーブル
●○〒150-0001
●○東京都渋谷区神宮前1丁目1-1 原宿TH 7F
●○TEL : 03-6447-1744   FAX : 03-6447-1745
●○https://www.timetable.jp/
●○--------------------------------------->
__posted_body__

## ※※※！！！※※※！！！※※※！！！※※※！！！※※※！！！※※※
## 自動返信メールの件名 (有効にする場合は下記の行頭#を外してください。)
## ※※※！！！※※※！！！※※※！！！※※※！！！※※※！！！※※※

$config{"ReturnSubject"} = '【ドット箔プリント】試し刷り ご注文確認メール';

## 自動返信メールの本文
$_TEXT{'responder'} = <<'__return_body__';
<_会社名（店舗名）_>
<_お名前_> 様

この度は「印刷+デザイン=タイムテーブル ドット箔プリント」へご注文いただきまして、誠にありがとうございます。
下記のご案内にしたがって続けてご入稿へお進みください。
ご入稿いただきましたらデータチェック後、折り返しご連絡させていただきます。
どうぞよろしくお願いいたします。

----------------------------------------
1.入力内容のご確認
----------------------------------------
■ご注文内容
ご注文種別：試し刷りのご注文
商　品：<_商品_>
<%サイズ:サイズ%>
<%印刷用紙:印刷用紙%>
<%箔の色数:箔の色数%>
<%箔の色:箔の色%>
<%印刷色数:印刷色数%>
<%印刷枚数:印刷枚数%>
<%印刷納期:印刷納期%>
<%加工オプション:加工オプション%>
<%スジ入れ加工:スジ入れ加工%>
<%折り加工:折り加工%>
<%孔開け加工（加工）:孔開け加工（加工）%>
<%孔開け加工（サイズ）:孔開け加工（サイズ）%>
<%角丸加工（加工）:角丸加工（加工）%>
<%角丸加工（サイズ）:角丸加工（サイズ）%>
<%簡易マチ加工（加工）:簡易マチ加工（加工）%>
<%簡易マチ加工（厚さ）:簡易マチ加工（厚さ）%>
<%PP加工・PET加工:PP加工・PET加工%>
<%プロッターカット加工:プロッターカット加工%>

<%【2】サイズ:サイズ_2%>
<%【2】印刷用紙:印刷用紙_2%>
<%【2】箔の色数:箔の色数_2%>
<%【2】箔の色:箔の色_2%>
<%【2】印刷色数:印刷色数_2%>
<%【2】印刷枚数:印刷枚数_2%>
<%【2】印刷納期:印刷納期_2%>
<%【2】加工オプション:加工オプション_2%>
<%【2】スジ入れ加工:スジ入れ加工_2%>
<%【2】折り加工:折り加工_2%>
<%【2】孔開け加工（加工）:孔開け加工（加工）_2%>
<%【2】孔開け加工（サイズ）:孔開け加工（サイズ）_2%>
<%【2】角丸加工（加工）:角丸加工（加工）_2%>
<%【2】角丸加工（サイズ）:角丸加工（サイズ）_2%>
<%【2】簡易マチ加工（加工）:簡易マチ加工（加工）_2%>
<%【2】簡易マチ加工（厚さ）:簡易マチ加工（厚さ）_2%>
<%【2】PP加工・PET加工:PP加工・PET加工_2%>
<%【2】プロッターカット加工:プロッターカット加工_2%>

<%件数:件数%>

制作環境：OS：<_OS_>
　　　　　使用アプリ：<_使用アプリ_>
備　考：<_印刷に関する備考_>

■ご注文者さまの情報
<%会社名（店舗名）:会社名（店舗名）%>
お名前：<_お名前_>
メールアドレス：<_email_>
ご住所：〒<_郵便番号_>
　　　　<_都道府県_><_市区町村_> <_建物名_>
電話番号：<_電話番号_>
お支払：お支払方法：<_お支払方法_>
　　　　お支払のタイミング：<_お支払のタイミング_>
　　　　ポイントの使用有無：<_ポイントの使用有無_>
<%　　　　ご利用ポイント:　　　　ご利用ポイント%>
　　　　原宿紙店のクーポン使用：<_原宿紙店のクーポン使用_>
備　考：<_注文者情報に関する備考_>

■発送に関する情報
印刷納期・発送方法：<_印刷納期・発送方法_>

送り状の記載内容：<_送り状の記載内容_>

<%会社名（店舗名） :会社名（店舗名） %>
<%お名前 :お名前 %>
<%ご住所2 :ご住所2%>
　　　　<_都道府県2_><_市区町村2_> <_建物名2_>
<%電話番号 :電話番号 %>
<%備　考 :発送に関する備考%>
----------------------------------------
2.データのご入稿について
----------------------------------------
データを1つのzipファイルにまとめてご入稿ください。

●10MBまでの場合
このメールにご返信・添付の上、ご入稿いただけます。

●10MBを超える場合
ファイル送信サービスをご利用ください。
このメールにご返信の上、ファイル送信サービスのダウンロードURLをお送りください。
(※ファイル送信サービスは他社様のサービスになります。お客さまご自身の責任のもとご利用ください。)

【Adobe Illustrator】のデータは当社aiテンプレートをご利用ください。
　白印刷のデータ作成方法は少々特殊です。
　また、試し刷りでは印刷可能範囲に制限があります。
　各印刷料金表ページの「印刷のみ 注文する」ボタンのすぐ下よりaiテンプレートをダウンロードいただき、
　アートボード左側のご説明を参考にしてご作成ください。

----------------------------------------
3.お支払について
----------------------------------------
●前払い（銀行振込）の場合
データチェック完了後に前払い割引(5%引)適用のご請求書をPDFファイルにて発行させていただきます。
先にデータをご入稿いただき、お振込の準備をしてお待ちください。

●前払い（クレジットカード払い）の場合
データチェック完了後に前払い割引(5%引)適用のご請求書をPDFファイルにて、
クレジットカード決済用URLをメールにて発行させていただきます。
先にデータをご入稿いただき、決済の準備をしてお待ちください。

●翌月末日払い（銀行振込）の場合（官公庁さま・資本金1,000万円以上の法人さまのみ選択可）
官公庁さま・資本金1,000万円以上の法人さまであることを確認させていただいた上で、
データチェック後に合計料金をご案内いたします。
ご請求書についてはPDFファイルにて「印刷開始メール」に添付させていただきます。
先にデータをご入稿いただき、お待ちください。


※本メールにお心当たりのない方は、恐れ入りますがその旨をご記入の上、
メール本文をそのままご返信くださいませ。

●○--------------------------------------->
●○印刷+デザイン=タイムテーブル
●○　　　　ドット箔プリント
●○https://foil.timetable.jp/
●○--------------------------------------->
●○運営会社　株式会社タイムテーブル
●○〒150-0001
●○東京都渋谷区神宮前1丁目1-1 原宿TH 7F
●○TEL : 03-6447-1744   FAX : 03-6447-1745
●○https://www.timetable.jp/
●○--------------------------------------->
__return_body__



####################################################
## スパム対策関連
####################################################

## Javascriptが無効の場合は送信を許可しない(1:許可しない / 0:許可する)
$config{'DisabledJs'} = 0;

## リファラードメインチェック / 有効にする場合は行頭の#を削除
#$config{'PostDomain'} = $ENV{'HTTP_HOST'};

## 全文英語のスパム候補を除外(1:除外 / 0:除外しない)
$config{'EnglishSpamBlock'} = 1;

## リンク系スパム候補を除外(1:除外 / 0:除外しない)
$config{'LinkSpamBlock'} = 1;

## URLの送信を許可しない(1:許可しない / 0:許可する)
$config{'DisableURI'} = 0;


####################################################
## 有効期限など
####################################################

## 送信数制限
#$config{'limit'} = 100;

## 期限の書式は YYYY-MM-DD HH:MM:SS です。
## 受付開始日時
#$config{'OpenDate'} = '2013-01-01 06:21:00';

## 受付終了日時
#$config{'CloseDate'} = '2013-03-09 00:00:00';


####################################################
## アドオン(Javascriptの追加機能)
####################################################

$config{'dir.AddOns'} = './add-ons/';

@AddOns = ();
#push @AddOns,'OperationCheck.js';		## 動作チェック
push @AddOns,'charactercheck.js';		## 文字校正
push @AddOns,'prefcode/prefcode.js';	## 郵便番号からの住所入力
push @AddOns,'furigana.js';				## フリガナ(Firefox非対応)
#push @AddOns,'charformat.js';			## テキスト整形(Xperia非対応)
#push @AddOns,'cart/cart.js';			## ショッピングカート機能
#push @AddOns,'phase.js';				## 段階的入力機能
#push @AddOns,'drilldown.js';			## ドリルダウン機能
#push @AddOns,'datelist.js';				## 日付リストの生成機能
#push @AddOns,'noresume.js';			## 入力された内容をレジュームしない
#push @AddOns,'switching.js';			## スイッチング機能サンプル
#push @AddOns,'prevention.js';			## イタズラ防止
#push @AddOns,'wellcome.js';			## (技術デモ)ウェルカムメッセージ
#push @AddOns,'speechAPI.js';			## (技術デモ)音声入力
#push @AddOns,'WadaVoiceDemo.js';		## (技術デモ)音声ガイダンス
#push @AddOns,'ResponsiveWeb.js';		## レスポンシブWeb対応(要カスタマイズ)
#push @AddOns,'progress.js';			## プログレスバー表示
#push @AddOns,'WTKConnect.js';			## WebsiteToolKit.jsとの連動
#push @AddOns,'submitdisabled.js';		## エラー時に送信無効
#push @AddOns,'sizeajustdisabled.js';	## 入力欄の自動調整機能を無効化
#push @AddOns,'defaultValue.js';		## 初期値を無効
#push @AddOns,'estimate.js';			## 見積計算(ベータ版)
#push @AddOns,'beforeunload.js';		## ページを離脱する際のアラート(ベータ版)

####################################################
## モジュール(CGIの追加機能)
####################################################

@Modules = ();
#push @Modules,'MultiConfig';	## 複数の設定ファイルを分岐させる
#push @Modules,'check';			## CGI動作環境チェック
#push @Modules,'thanks';		## サンクスページへの引き継ぎ
#push @Modules,'cart';			## ショッピングカート機能
#push @Modules,'ISO-2022-JP';	## メールをJISで送信
#push @Modules,'HTMLMail';		## 自動返信メールにHTMLメールを追加
#push @Modules,'CSVExport';		## CSV保存機能
#push @Modules,'SQLExport';		## SQL発行機能
#push @Modules,'vCard';			## vCard機能
#push @Modules,'iCal';			## iCal連携機能
#push @Modules,'IPLogs';		## IPログトラッキング機能
#push @Modules,'PayPal';		## PayPal決済
#push @Modules,'SMTP';			## SMTP送信 [Update]
#push @Modules,'mailauth';		## メールアドレス認証 [New]
#push @Modules,'reqonce';		## 一度きりの送信 [New]
#push @Modules,'questionnaire';	## アンケート集計モジュール [New]
#push @Modules,'GmailSMTP';		## GmailのSMTPを使う場合 [New]
#push @Modules,'regist';		## メールアドレスの登録・解除 [New]


####################################################
## 高度な設定的な感じのもの
####################################################

## 詳細なsendmail設定
#$config{'sendmail_advanced'} = '/usr/local/bin/sendmail -t -f$email';

## 表示調整 単一行表示
$config{'singleline'} = " %s ： %s\n";

## 表示調整 複数行表示
$config{'multiline'} = " %s ：\n%s\n\n";

## 未入力の項目を含める(1: on / 0: off)
$config{'blankfield'} = 0;

## 連続送信対応
$config{'seek'} = 0;

## 開封確認 (開封確認を通知する場合は以下の1行のコメントを解除)
#$config{'Notification'} = $mailto[0];

## 各種データを格納しているファイル

$config{'data.dir'} = './data/';

## [0] Serial, [1] InputTime, [2] ConfirmTime, [3] UniqueUser
$config{'file.data'} = "$config{'data.dir'}dat.mailformpro.cgi";

## ドロップ検知
$config{'file.drop'} = "$config{'data.dir'}dat.drop.cgi";

## jsキャッシュ
$config{'file.cache'} = "$config{'data.dir'}mfp.cache.js";

## 言語設定ファイル
$config{'lang'} = 'lang.ja';
#$config{'lang'} = 'lang.en';

## スクリプトのURL / ※基本的にここは変更しなくてOKです
$config{'uri'} = 'https://' . $ENV{'SERVER_NAME'} . $ENV{'SCRIPT_NAME'};

## Prefix
$config{'prefix'} = '_MFP';